BMI = {
    "thin3":{
        'status':'ผอมมากไป',
        'des':'น้ำหนักน้อยกว่าปกติ หากคุณสูงมากแต่น้ำหนักน้อยเกินไป อาจเสี่ยงต่อการได้รับสารอาหารไม่เพียงพอหรือได้รับพลังงานไม่เพียงพอ ส่งผลให้ร่างกายอ่อนเพลียง่าย การรับประทานอาหารให้เพียงพอ และการออกกำลังกายเพื่อเสริมสร้างกล้ามเนื้อสามารถช่วยเพิ่มค่า BMI ให้อยู่ในเกณฑ์ปกติได้'
    },
    "thin2":{
        'status': 'ผอมพอสมควร',
        'des':'น้ำหนักน้อยกว่าปกติ หากคุณสูงมากแต่น้ำหนักน้อยเกินไป อาจเสี่ยงต่อการได้รับสารอาหารไม่เพียงพอหรือได้รับพลังงานไม่เพียงพอ ส่งผลให้ร่างกายอ่อนเพลียง่าย การรับประทานอาหารให้เพียงพอ และการออกกำลังกายเพื่อเสริมสร้างกล้ามเนื้อสามารถช่วยเพิ่มค่า BMI ให้อยู่ในเกณฑ์ปกติได้'
    },
    "thin":{
        'status':'ผอม',
        'des':'น้ำหนักน้อยกว่าปกติ หากคุณสูงมากแต่น้ำหนักน้อยเกินไป อาจเสี่ยงต่อการได้รับสารอาหารไม่เพียงพอหรือได้รับพลังงานไม่เพียงพอ ส่งผลให้ร่างกายอ่อนเพลียง่าย การรับประทานอาหารให้เพียงพอ และการออกกำลังกายเพื่อเสริมสร้างกล้ามเนื้อสามารถช่วยเพิ่มค่า BMI ให้อยู่ในเกณฑ์ปกติได้'
    },
    "good":{
        'status':'สมส่วน',
        'des':'จัดอยู่ในเกณฑ์ปกติ ห่างไกลโรคที่เกิดจากความอ้วน และมีความเสี่ยงต่อการเกิดโรคต่าง ๆ น้อยที่สุด ควรพยายามรักษาระดับค่า BMI ให้อยู่ในระดับนี้ให้นานที่สุด และควรตรวจสุขภาพทุกปี'
    },
    "fat":{
        'status':'น้ำหนักเกิน',
        'des':'น้ำหนักที่เหมาะสมสำหรับคนไทยคือค่า BMI ระหว่าง 18.5-24 จัดอยู่ในเกณฑ์ปกติ ห่างไกลโรคที่เกิดจากความอ้วน และมีความเสี่ยงต่อการเกิดโรคต่าง ๆ น้อยที่สุด ควรพยายามรักษาระดับค่า BMI ให้อยู่ในระดับนี้ให้นานที่สุด และควรตรวจสุขภาพทุกปี'
    },
    "fat1":{
        'status':'น้ำหนักเกิน ระดับ 1',
        'des':'อ้วนในระดับหนึ่ง ถึงแม้จะไม่ถึงเกณฑ์ที่ถือว่าอ้วนมาก ๆ แต่ก็ยังมีความเสี่ยงต่อการเกิดโรคที่มากับความอ้วนได้เช่นกัน ทั้งโรคเบาหวาน และความดันโลหิตสูง ควรปรับพฤติกรรมการทานอาหาร ออกกำลังกาย และตรวจสุขภาพ'
    },
    "fat2":{
        'status':'น้ำหนักเกิน ระดับ 2',
        'des':'ค่อนข้างอันตราย เสี่ยงต่อการเกิดโรคร้ายแรงที่แฝงมากับความอ้วน หากค่า BMI อยู่ในระดับนี้ จะต้องปรับพฤติกรรมการทานอาหาร และควรเริ่มออกกำลังกาย และหากเลขยิ่งสูงกว่า 40.0 ยิ่งแสดงถึงความอ้วนที่มากขึ้น ควรไปตรวจสุขภาพ และปรึกษาแพทย์'
    },
    "fat3":{
        'status':'น้ำหนักเกิน ระดับ 3',
        'des':'ค่อนข้างอันตราย เสี่ยงต่อการเกิดโรคร้ายแรงที่แฝงมากับความอ้วน หากค่า BMI อยู่ในระดับนี้ จะต้องปรับพฤติกรรมการทานอาหาร และควรเริ่มออกกำลังกาย และหากเลขยิ่งสูงกว่า 40.0 ยิ่งแสดงถึงความอ้วนที่มากขึ้น ควรไปตรวจสุขภาพ และปรึกษาแพทย์'
    }
}

foods = {
    "padtai" : {
        "name" : "ผัดไทย",
        "cal" : 450
    },
    "noodle" : {
        "name" : "ก๋วยเตี๋ยว",
        "cal" : 500
    },
    "padkapao":{
        "name":"ผัดกะเพรา",
        "cal": 561 
        },
    "chicken":{
        "name":"ข้าวมันไก่",
        "cal":695
        },
    "karee":{
        "name":"ผัดพงกะหรี่",
        "cal":746.1
        },
    "pad":{
        "name":"ข้าวผัด",
        "cal":163
        },
    "kaosoy":{
        "name":"ข้าวซอย",
        "cal":154
        },
    "kao-na-kai-yak":{
        "name":"ข้าวหน้าไก่ย่าง",
        "cal":397.5
    },
    "lummu":{
        "name":"ลาบหมู",
        "cal":130
    }
}